Q1

In [2]:
import pandas as pd
data = {"Tid" : [i for i in range(1,11)],
        "Refund": ['Yes','No','No','Yes','No','No','Yes','No','No','No'],
        "Marital Status": ['Single','Married','Single','Married','Divorced','Married','Divorced','Single','Married','Single'],
        "Taxable Income": ['125K','100K','70K','120K','95K','60K','220K','85K','75K','90K'],
        "Cheat": ['No','No','No','No','Yes','No','No','Yes','No','Yes']}
df = pd.DataFrame(data)
print(df)

   Tid Refund Marital Status Taxable Income Cheat
0    1    Yes         Single           125K    No
1    2     No        Married           100K    No
2    3     No         Single            70K    No
3    4    Yes        Married           120K    No
4    5     No       Divorced            95K   Yes
5    6     No        Married            60K    No
6    7    Yes       Divorced           220K    No
7    8     No         Single            85K   Yes
8    9     No        Married            75K    No
9   10     No         Single            90K   Yes

Q2

In [4]:
print(df.loc[[0,4,7,8]])

   Tid Refund Marital Status Taxable Income Cheat
0    1    Yes         Single           125K    No
4    5     No       Divorced            95K   Yes
7    8     No         Single            85K   Yes
8    9     No        Married            75K    No

Q3

In [15]:
print(df.loc[3:7])
print()
print(df.iloc[4:9,2:5])
print()
print(df.iloc[::,1:4])

   Tid Refund Marital Status Taxable Income Cheat
3    4    Yes        Married           120K    No
4    5     No       Divorced            95K   Yes
5    6     No        Married            60K    No
6    7    Yes       Divorced           220K    No
7    8     No         Single            85K   Yes

  Marital Status Taxable Income Cheat
4       Divorced            95K   Yes
5        Married            60K    No
6       Divorced           220K    No
7         Single            85K   Yes
8        Married            75K    No

  Refund Marital Status Taxable Income
0    Yes         Single           125K
1     No        Married           100K
2     No         Single            70K
3    Yes        Married           120K
4     No       Divorced            95K
5     No        Married            60K
6    Yes       Divorced           220K
7     No         Single            85K
8     No        Married            75K
9     No         Single            90K

Q4

In [34]:
import kagglehub

# Download latest version
path = kagglehub.dataset_download("uciml/iris")

print("Path to dataset files:", path)

csv_path = "/root/.cache/kagglehub/datasets/uciml/iris/versions/2/Iris.csv"
iris = pd.read_csv(csv_path)
first = iris.head(5)
print(first)

Path to dataset files: /root/.cache/kagglehub/datasets/uciml/iris/versions/2
   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

Q5

In [35]:
first = first.drop(index =3)
first = first.drop(first.columns[2], axis=1)
print(first)

   Id  SepalLengthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1            1.4           0.2  Iris-setosa
1   2            4.9            1.4           0.2  Iris-setosa
2   3            4.7            1.3           0.2  Iris-setosa
4   5            5.0            1.4           0.2  Iris-setosa

Q6

In [11]:
import csv

csvdata = [["Employee_ID","Name","Department","Age","Salary","Years_of_Experience","Joining_Date","Gender","Bonus","Rating"],
        [101,"Alice","HR",29,50000,4,"2020-03-15","Female",5000,4.5],
        [102,"Bob","IT",34,70000,8,"2017-07-19","Male",7000,4.0],
        [103,"Charlie","IT",41,65000,10,"2013-06-01","Male",6000,3.8],
        [104,"Diana","Marketing",28,55000,3,"2021-02-10","Female",4500,4.7],
        [105,"Edward","Sales",38,60000,12,"2010-11-25","Male",5000,3.5]]

with open('employees.csv', 'w', newline='') as csvfile:
  writer = csv.writer(csvfile)
  writer.writerows(csvdata)

Employeedata = pd.read_csv("employees.csv")

shape = Employeedata.shape
print(f"Shape = {shape}")
print()

print("Summary: ")
print(Employeedata.info())
print()

print("Descriptive statistics: ")
print(Employeedata.describe())
print()

print("First 5 rows: ")
print(Employeedata.head(5))
print("Last 2 rows:")
print(Employeedata.tail(2))
print()

print("Avg salary: ", Employeedata["Salary"].mean())
print("Total bonus given: ",sum(Employeedata["Bonus"]) )
print("Age of youngest employee: ",min(Employeedata["Age"]))
print("Highest performance rating: ", max(Employeedata["Rating"]))
print()

print("Sorted data: ")
Employeedata.sort_values(["Salary"],
                    axis=0,
                    ascending=[False],
                    inplace=True)
print(Employeedata)

print()
rating = Employeedata["Rating"]
remarks =[]
for x in rating:
  if x>=4.5:
    remarks.append('Excellent')
  elif x>=4.0:
    remarks.append('Good')
  else:
    remarks.append('Average')
Employeedata["Performance"]= remarks
print("Data after adding column: ")
print(Employeedata)
print()

print("Missing values: \n", Employeedata.isnull())
print()

Employeedata.rename(columns={"Employee_ID": "ID"}, inplace=True)
print("After column name change: ")
print(Employeedata)
print()

print("Employees with more than 5 years of experience: ")
print(Employeedata.loc[Employeedata['Years_of_Experience']>5])
print("Employees of IT department: ")
print(Employeedata[Employeedata["Department"].str.contains("IT")])
print()

tax =[0.1*sal for sal in Employeedata["Salary"]]
Employeedata["Tax"]=tax
print("Adding new column: ")
print(Employeedata)

with open('Updatedemployees.csv', 'w', newline='') as csvfile:
  writer = csv.writer(csvfile)
  writer.writerows(Employeedata)

Shape = (5, 10)

Summary:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Employee_ID          5 non-null      int64
 1   Name                 5 non-null      object
 2   Department           5 non-null      object
 3   Age                  5 non-null      int64
 4   Salary               5 non-null      int64
 5   Years_of_Experience  5 non-null      int64
 6   Joining_Date         5 non-null      object
 7   Gender               5 non-null      object
 8   Bonus                5 non-null      int64
 9   Rating               5 non-null      float64
dtypes: float64(1), int64(5), object(4)
memory usage: 532.0+ bytes
None

Descriptive statistics:
       Employee_ID        Age       Salary  Years_of_Experience   Bonus  \
count     5.000000   5.000000      5.00000             5.000000     5.0
mean    103.000000  34.000000  60000.00000             7.400000  5500.0
std       1.581139   5.612486   7905.69415             3.847077  1000.0
min     101.000000  28.000000  50000.00000             3.000000  4500.0
25%     102.000000  29.000000  55000.00000             4.000000  5000.0
50%     103.000000  34.000000  60000.00000             8.000000  5000.0
75%     104.000000  38.000000  65000.00000            10.000000  6000.0
max     105.000000  41.000000  70000.00000            12.000000  7000.0

         Rating
count  5.000000
mean   4.100000
std    0.494975
min    3.500000
25%    3.800000
50%    4.000000
75%    4.500000
max    4.700000

First 5 rows:
   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
0   2020-03-15  Female   5000     4.5
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5
Last 2 rows:
   Employee_ID    Name Department  Age  Salary  Years_of_Experience  \
3          104   Diana  Marketing   28   55000                    3
4          105  Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5

Avg salary:  60000.0
Total bonus given:  27500
Age of youngest employee:  28
Highest performance rating:  4.7

Sorted data:
   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
4          105   Edward      Sales   38   60000                   12
3          104    Diana  Marketing   28   55000                    3
0          101    Alice         HR   29   50000                    4

  Joining_Date  Gender  Bonus  Rating
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
4   2010-11-25    Male   5000     3.5
3   2021-02-10  Female   4500     4.7
0   2020-03-15  Female   5000     4.5

Data after adding column:
   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
4          105   Edward      Sales   38   60000                   12
3          104    Diana  Marketing   28   55000                    3
0          101    Alice         HR   29   50000                    4

  Joining_Date  Gender  Bonus  Rating Performance
1   2017-07-19    Male   7000     4.0        Good
2   2013-06-01    Male   6000     3.8     Average
4   2010-11-25    Male   5000     3.5     Average
3   2021-02-10  Female   4500     4.7   Excellent
0   2020-03-15  Female   5000     4.5   Excellent

Missing values:
    Employee_ID   Name  Department    Age  Salary  Years_of_Experience  \
1        False  False       False  False   False                False
2        False  False       False  False   False                False
4        False  False       False  False   False                False
3        False  False       False  False   False                False
0        False  False       False  False   False                False

   Joining_Date  Gender  Bonus  Rating  Performance
1         False   False  False   False        False
2         False   False  False   False        False
4         False   False  False   False        False
3         False   False  False   False        False
0         False   False  False   False        False

After column name change:
    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
4  105   Edward      Sales   38   60000                   12   2010-11-25
3  104    Diana  Marketing   28   55000                    3   2021-02-10
0  101    Alice         HR   29   50000                    4   2020-03-15

   Gender  Bonus  Rating Performance
1    Male   7000     4.0        Good
2    Male   6000     3.8     Average
4    Male   5000     3.5     Average
3  Female   4500     4.7   Excellent
0  Female   5000     4.5   Excellent

Employees with more than 5 years of experience:
    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
4  105   Edward      Sales   38   60000                   12   2010-11-25

  Gender  Bonus  Rating Performance
1   Male   7000     4.0        Good
2   Male   6000     3.8     Average
4   Male   5000     3.5     Average
Employees of IT department:
    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01

  Gender  Bonus  Rating Performance
1   Male   7000     4.0        Good
2   Male   6000     3.8     Average

Adding new column:
    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
4  105   Edward      Sales   38   60000                   12   2010-11-25
3  104    Diana  Marketing   28   55000                    3   2021-02-10
0  101    Alice         HR   29   50000                    4   2020-03-15

   Gender  Bonus  Rating Performance     Tax
1    Male   7000     4.0        Good  7000.0
2    Male   6000     3.8     Average  6500.0
4    Male   5000     3.5     Average  6000.0
3  Female   4500     4.7   Excellent  5500.0
0  Female   5000     4.5   Excellent  5000.0